Renameing

In [1]:
import numpy as np
import pandas as pd
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
  }
df = pd.DataFrame(data)
print(df)

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [ ]:
df.rename(columns = {"Department" : "dept"}) # just show the change col, not permanently change the col name

      Name   Age     dept   Salary
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

In [3]:
df.rename(columns = {"Department" : "dept"}, inplace= True) # derictly change the col name 
df

      Name   Age     dept   Salary
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

In [4]:
df["dept"].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [5]:
df["dept"].value_counts()

dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [6]:
df["present_Salary"] = df["Salary"] +11
df

      Name   Age     dept   Salary  present_Salary
0    Alice  25.0       HR  50000.0         50011.0
1      Bob  30.0       IT  60000.0         60011.0
2  Charlie  35.0  Finance  70000.0         70011.0
3    David   NaN       IT  62000.0         62011.0
4      Eve  29.0       HR      NaN             NaN
5    Alice  25.0       HR  50000.0         50011.0

Data cleanig